# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
n = (-5, 2, 4, 0, 4, 8, 2)
i = 0
for sum in n:
    i = i+sum
print(i)
