# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех положительных элементов.

# TODO: your code here
i = 0
for sum in n:
    if sum>0:
        i = i + sum

print(i)
